{
  "Question": [
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "“I have tried several biryani recipes, none come near this one. Thank you for sharing this gem!”"
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "It took me absolutely no effort to bring you this biryani recipe. All I had to do was find the best biryani in Houston, dissect it, hound poor Rizwan for details, perform 10+ trials, use the concepts in Salt Acid Fat Heat to further perfect it, survey my email list for preferences, interpolate to figure out spice quantities, and you know…cry a little."
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "In short, I literally ate, slept, and breathed biryani until I could proudly publish this most-beloved, highly requested recipe and do it justice. Phew. Let’s do this."
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "I recommend you use the biryani masala recipe below (all you need is a good spice grinder and a few extra whole spices). If you’d prefer not to, you can substitute your favorite store-bought biryani masala. This recipe has been tested and works great with Bombay Biryani Masala."
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "To make Biryani masala for this recipe, combine the following ingredients in a spice grinder and process until mostly smooth. Makes ~2 tbsp, which is the exact quantity you’ll need for this recipe."
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "Note: You don’t have to have every single one of these spices to make a wonderful biryani. Don’t worry if you’re missing some – it’ll still give your biryani exceptional flavor!"
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "If you’re using the recommended aged, long-grain basmati rice, you’ll need to boil for 5 minutes. If you’re using newly harvested basmati rice often found in American grocery stores, it’ll require a shorter boiling time (around 4 minutes)."
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "For reference, here’s how my rice acts minute-to-minute:"
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "Determining the right ratio of rice to meat can be tricky. I figured the best way to break this down is with this table:"
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "I’ve tested this recipe several times with double the quantity. Here’s what’ll change:"
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "Potatoes in biryani are a point of contention, with responses ranging from “Is it even biryani if it doesn’t have potatoes?” to “With potatoes, it’s pulao.” "
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "Since I don’t have a strong preference, I thought it’s best for me to explain how to add them and then leave it up to you."
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "If you enjoy this recipe, please consider leaving a star rating along with your comment. Not only do your reviews make my day, but they help others find my recipe online."
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "I love this recipe and have made it several times with both chicken and goat over the last few years.\nThis brings me to my question, I’m hosting 20 people and don’t have time to cook goat (making with goat) over the stove. So, can I pressure cook the meat in an instant pot (similarly to you aloo gosht recipe)? If so, any idea how much water to add? Thanks in advance for the reply. "
    },
    {
      "url": "https://ministryofcurry.com/chicken-biryani/",
      "text": "\n              If for some reason after verifying the captcha above, you are constantly being redirected to this exact same page to re-verify the captcha again, then please click on the button below to get in touch with the support team.\n            "
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "OK wait. Did you almost lose control too?"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "There’s a lengthy list but there’s nothing exotic here, you can find all these spices at everyday supermarkets here in Australia. Some recipes call for Asafoetida which is an Indian spice that requires a trip to an Indian grocer. We tried it with and without, and I swear we could not taste a difference. So we don’t use it. 🙂"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "I believe you can make great food with everyday ingredients even if you’re short on time and cost conscious. You just need to cook clever and get creative!"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "\nThis is first time I have made a Biryani and it was a success, thanks to your excellent instructions, notes, video and details. I used flat leaf parsley as here in NZ winter, fresh coriander is horrendous expensive for a very small bunch.  I look forward to making this recipe again."
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "Thanks, Nagi.   You are quickly becoming my go-to site for new recipes!  I even tried your no yeast flatbread since I didn’t have time for (your) naan!"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "\nI have made this so many times, it is the best recipe.  Hands down better than any takeaway biryani.  I use skinless/boneless chicken thighs, adding lemon to the marinade and it is fabulous.  And if there are leftovers, they are so good too.  Thank you for this recipe."
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "\nHi\nWe are working on a website for aerecipes and want a backlink from your website. This backlink will help us to increase our domain authority and make a good impression on websites.\nKindly visit our website\nhttps://aerecipes.com/\nWe will be very grateful to you for this favor."
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "\nHi\nWe are working on a website for Towel and want a backlink from your website. This backlink will help us to increase our domain authority and make a good impression on websites.\nKindly visit our website\nhttps://towelinfo.com/\nWe will be very grateful to you for this favor."
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "\nCan I just say this recipe tastes amazing but 3 litres of water is not equal to three quarts… Do not use 3 litres haha"
    },
    {
      "url": "https://bakewithzoha.com/best-chicken-biryani/",
      "text": "\n              If for some reason after verifying the captcha above, you are constantly being redirected to this exact same page to re-verify the captcha again, then please click on the button below to get in touch with the support team.\n            "
    }
  ],
  "Description": [
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "Behold! An authentic Chicken Biryani recipe with simple, easy-to-follow instructions (no curveballs!) and mouthwatering, traditional Pakistani and Indian flavor. This recipe includes tips on how to get fluffy rice, tender chicken, and the distinct biryani taste. Tested to perfection!"
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "More Famous Chicken Recipes: Butter Chicken, Chicken Jalfrezi, and Chicken Karahi"
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "I’ve intentionally chosen the ingredients and quantities to give this biryani a strong foundation. That said, this recipe can take quite a bit of substitutions and adaptations and still be excellent."
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "Pakistani biryani is heavy on spice (and flavor!), and is often made with biryani masala, or simply put, a medley of spices that come together to give it a distinct, masaledar (or spice-laden) taste."
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "There are 3 components that make the chicken tender and deeply flavored:"
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "I’ve found Rizwan’s statement to be true. When steam permeates through the rice, spices, herbs, and chicken, it infuses the biryani with so much flavor that each bite is a treat."
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "Unless you’re making larger quantities, don’t worry about buying a special pot for biryani. I’ve tried using a cheap dutch oven with a tava underneath and a cast iron dutch oven and both worked well. Here are a few tips:"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "And it was worth it. (Belly and all.) Biryani, we can’t get enough of you!"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "The pot is then covered and cooked over a low heat for about 25 minutes during which time the rice absorbs the aromas and flavours of the curry underneath, whilst still being beautifully fluffy."
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "That moment when you lift the lid and are greeted with this sight…"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "To learn the techniques, we looked at a few books (love the local library!), dozens of internet pages and Youtube videos from home cooks in India."
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "Hungry for more? Subscribe to my newsletter and follow along on Facebook, Pinterest and Instagram for all of the latest updates."
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "This is how he spent most of today. (And yesterday. And the day before.)"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "\nWas worried that this might be a little complicated when confronted with the list of ingredients, simple is best! But it was easily done in two stages and a wonderful outcome. Will include in a repertoire of regulars for variety"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "\nI used left over homemade madras sauce for the marinade and also added frozen peas on top of chicken. Used the dried shallots as we always have them plus substituted coconut milk instead of ghee. Added a few dabs on unsalted button at end. Was delicious. Rice was perfect."
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "\nA firm favourite! I’ve made this recipe four times now and it has never disappointed. I’ve made it for my family of 4. I also increased the quantities and have made it twice now for 20 people! I was a little bit unsure as it how it would go when increasing it to such a large volume. But it was absolutely incredible. So so many compliments at my dinner parties. Thank you Nagi. It really is a great recipe. I usually marinate the chicken the night before. I just use chicken thigh without the bone. I did it with the bone once and the flavour was the same. I just find it easier to cook without the bone. I highly recommend xxx"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "Excellent!  Our family of 9 loved this!  Only change was adding 2 cinnamon sticks to the rice and squeezing fresh lemon as a finishing touch.  Thank you!"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "\nI haven’t tried authentic biryani, but I made this because hubby used to work in Qatar and Dubai. He said he missed biryani so I followed this recipe on the dot! He liked it! Although, he said it was missing a little bit of aroma. Also, he was looking for the cinnamon bark. Overall, he said this was better than takeaway biryani in our area."
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "\nI made this the other night and after 13 years together, my husband and son declared this dish as the best I’ve ever ever made!  I made the full amount and was able to get two meals out it.  Best of all, everything was already in the pantry – the only thing I needed to buy was star anise and saffron.  "
    }
  ],
  "Conclusion": [],
  "Other": [
    {
      "url": "https://www.indianhealthyrecipes.com/chicken-biryani-recipe/",
      "text": "If you are the site owner (or you manage this site), please whitelist your IP or if you think this block is an error please open a support ticket and make sure to include the block details (displayed in the box below), so we can assist you in troubleshooting the issue. "
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "I believe this recipe is as easy as an authentic biryani recipe can be – no superfluous or tedious steps that don’t contribute to big flavor. You’ll find that while it takes time, most of it is passive cooking time. And the end result is quite rewarding and impressive. These are 3 main parts to making chicken biryani:"
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "Identifying doneness can be confusing, so I’ve simplified it by giving time parameters to take the guesswork out of boiling."
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "Tip: Drain the rice promptly so the hot water doesn’t continue cooking the rice."
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "Also note that a little overcooked or undercooked rice is not going to ruin your biryani. "
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "Note that these are my preferred ratios. Feel free to increase the rice by 1/4 cup if you prefer more rice and less chicken."
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "A whooping 52% of my email community found getting the taste right to be the most difficult part of making biryani. Here’s what I’ve found:"
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "Though you can use any pot or pan you’d like to prepare the chicken and parboil the rice, a Dutch oven or deep pot (at least 5 qt) will be helpful for the steaming (‘dum’) stage."
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "(Update: 8/29/24) I’ve often been asked how to steam biryani in the oven. I prefer a longer steam at lower heat to a shorter steam at higher heat. To steam in the oven:"
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "If you’re in a rush, you can steam at 300°F-320°F (150°C-160°C) for 30 minutes. "
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "I’ve kept the layering simple, but you can make it as festive as you’d like by adding sliced tomatoes, store-bought/homemade fried onions, or green chili peppers in between or on top of the chicken and rice."
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "Tip: To double the recipe within the recipe card, hover to top right of the ingredients and adjust the recipe by clicking 2x. This will adjust the all the ingredient quantities for you."
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "Countless readers have reported success using boneless chicken, lamb, goat, beef, and more. Lamb or goat will require 2 hours to cook, and to compensate for the longer cook time, you’ll need to add more water. If using boneless chicken, add 1/4 cup water instead of 1/2 and cook for 15 minutes. See FAQs for a general cook time table."
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "Biryani is a stand-alone dish, and a simple or Vegetable Raita or Mint Raita will be enough alongside it. Kachumber Salad or fresh, crunchy vegetables such as sliced onions, carrots, or cucumbers will add crunch and texture. "
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "If you’re serving it for guests, kebabs like Aloo Tikki (Potato Cakes), Chapli Kabab, or Shami Kebab would pair well."
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "Tried this recipe? If you have a minute, please consider leaving a comment telling me how it was! You can also take a quick picture and upload it directly into the comments. If you’re on Instagram, please tag me so I can see your creations. I truly love hearing from you. Thank you!"
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "\nposted by Izzah Cheema \t\ton November 13, 2020 (updated June 30, 2025) "
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "\n 528 comments\n\nLeave a comment »\n"
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "Your email address will not be published. Required fields are marked *"
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "Notify me if Izzah replies to my comment"
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "\nShare your photo!Inspire others by uploading an image of your creation along with your review.\t\t\t\t\n\r\n\t\t\t\t\tThe maximum upload file size: 5 MB.\t\t\t\t\n\r\n\t\t\t\t\tYou can upload: image.\t\t\t\t\n\n\r\n\t\t\t\t\t\tDrop files here\t\t\t\t\t\n\n"
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "Loved this recipe. I have tried it twice now and it tastes amazing. I just halved the whole spices the second time as it felt like too much work to separate it while eating. It did not impact the taste at all!"
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "That’s great feedback Sehrish! The biryani that inspired it was very heavy on the whole spices so I kept that way but they’re certainly adjustable. Thanks for taking the time to share!"
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "Is the chili powder listed in the marinade the  typical American chili powder or cayenne powder?  I made a butter chicken recipe where the author said that typically when Indian recipes call for chili powder they mean cayenne."
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "Hi Suzy, That is correct. Use cayenne pepper for the chili powder. Hope that helps!"
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "Hi! I’m Izzah, and I look forward to brightening your day with good food and good vibes. Here you'll find tested & perfected South Asian recipes that are easy-to-follow yet authentic in taste!"
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "Authentic south Asian cooking for the modern kitchen"
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "Learn my secrets to instantly improve your South Asian cooking!"
    },
    {
      "url": "https://www.teaforturmeric.com/chicken-biryani/",
      "text": "©2025 Tea for Turmeric. \n\t\tDesign by Purr. Support by Foodie Digital."
    },
    {
      "url": "https://ministryofcurry.com/chicken-biryani/",
      "text": "\n              We're checking if you're a real person and not an automated bad bot. Usually, the captcha below will complete itself. If it doesn't, simply click the checkbox in the captcha to verify. Once verified, you'll be taken to the page you wanted to visit.\n            "
    },
    {
      "url": "https://ministryofcurry.com/chicken-biryani/",
      "text": "Please mention the \"Ray ID: 975901791ea69d73\" and \"Client IP: 106.51.170.86\" to your ticket."
    },
    {
      "url": "https://ministryofcurry.com/chicken-biryani/",
      "text": "Ray ID: 975901791ea69d73 | Client IP: 106.51.170.86"
    },
    {
      "url": "https://ministryofcurry.com/chicken-biryani/",
      "text": "Performance & security by BigScoots"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "Biryani is a celebration of all that is great about Indian food – the heady aromas, the vibrant colours, the fluffy rice and those addictive curry flavours. Make this Chicken Biryani with your protein of choice – or try a vegetable biryani!"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "One of the most requested recipes is finally here! Another RecipeTin Family effort, it took us seven attempts to get this biryani right."
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "Seven attempts means seven heated arguments about who would take the leftover biryani because somebody in the RecipeTin family, at any point in time, usually declares themselves to be on a diet to address blog-related weight gain concerns."
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "Essentially, it’s your favourite chicken curry (or vegetable or other protein of choice) buried under a mound of delicately spiced fluffy rice, all made in one pot. The rice is steamed over a low heat so it absorbs the flavours of the curry bubbling away underneath."
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "So in a nutshell, it’s every curry loving-carb monsters’ dream come true. It’s got my name written all over it!"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "You’ll find variations of Biryani all across the Indian subcontinent, from Pakistan to Bangladesh, Afghanistan to India. There are 2 main types – one where the protein and/or vegetables are cooked mixed throughout the rice, and the other version known as Hyderabad-style biryani in India where meat and rice are layered and cook in a sealed pot over fire. The latter is the style of biryani I’m sharing today."
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "There’s a wonderful Afghani restaurant in my area called Sahar (Newport, Sydney) which serves a Biryani that’s a huge favourite among locals. Hands down, the best ethnic restaurant I know in the upper northern beaches."
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "Chicken marinated in a spiced yoghurt is placed in a large pot, then layered with fried onions (cheeky easy sub below!), fresh coriander/cilantro, then par boiled lightly spiced rice."
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "The crowning glory is to finish it off with a drizzle of saffron infused water to give it the signature patches of bright yellow rice, as well as ghee (or melted butter) for buttery richness."
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "…. that moment is only second to this: when you dig deep into the pot, ensuring you get some of every layer, and the full force of the aroma from the curry buried deep under the rice hits you, and it takes every single bit of will power to gravitate that spoon towards a bowl instead of attempting to shove that entire giant scoop in your mouth…."
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "I’m almost done. Bear with me – just want to show you a few more things before handing over the recipe!"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "There’s subtle flavourings used for the rice, and a load more used for the curry sauce."
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "Thin slices of onion fried until sweet and a bit crispy, this is used as one of the layers in the Biryani as well as a garnish for serving."
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "If you aren’t a fan of deep frying or are a beginner cook, my cheeky alternative is using store bought fried onion (Asian or Indian stores) or Asian Fried Shallots (pictured below) which are sold at everyday supermarkets. They add the same oniony flavour with the added bonus of extra crunch!"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "Another recipe ticked off the Recipe Request list, another RecipeTin family effort!!"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "As always, we love to look to the pros to build a starting point for recipe inspiration. We ate biryani at our favourite specialty restaurants in Sydney, Pakistani chain Student Biryani in Auburn, and the Indian restaurant Paradise Biryani House in North Strathfield."
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "Yes the ingredients list is long – but you’ll find everything at the supermarket. And while there are a number of steps to make Biryani, it is actually quite a straightforward recipe. (Video is helpful too!)"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "And even if yours doesn’t turn out perfect, don’t be put off because even less than perfect biryani is still delicious (we happily scoffed the first few test batches despite the flaws!). – Nagi x"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "Give this Everyday Cabbage Salad an Indian spin by sauteing garlic and cumin seeds in oil before mixing up with other Dressing ingredients"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "No Yeast Easy Soft Flatbread. Perfect to use as naan!"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "\n\t\t\t\t\t\t\tJoin my free email list to receive THREE free cookbooks!\t\t\t\t\t\t"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "Your email address will not be published. Required fields are marked *"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "Notify me via e-mail if anyone answers my comment."
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "\nNơi hội tụ các bộ phim 18+ đặc sắc, đa dạng nhất Việt Nam với link xem trực tiếp miễn phí, tốc độ tải nhanh, bảo mật tối đa trên sex anime hiếp."
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "\nWow, wow, wow!  This was TEMENDOUS. I even had to make a few subs (because I didn’t read carefully enough when planning) but scoured the internet for them.  I really can’t imagine it being any BETTER without my subs, but can’t wait to try!"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "\nTurned out perfect, didn’t splurge for the saffron but followed everything else exactly. Will make again soon!"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "\nI made this tonight, following Nagi’s recipe. Most of my spices were fresh, but some have been in my cupboard for years. Even so, this was utterly delicious. I marinated the chicken overnight, then followed the recipe absolutely, although I did reduce the cayenne pepper. My family was so impressed! Thank you, Nagi, for another delicious meal."
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "\nThis recipe is very good. Have made this lots!!! Very delicious"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "Every time I make a recipe of yours it is always delicious. I used lamb leg steaks instead and a lot less water for the rice cooking. The whole family loved it and are looking forward to leftovers!"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "Checking one of the ingredients / steps: is it really 2 TABLEspoons of salt? That seems awfuly salty"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "\n\t\t\t\t\t\t\tJoin my free email list to receive THREE free cookbooks!\t\t\t\t\t\t"
    },
    {
      "url": "https://www.recipetineats.com/biryani/",
      "text": "\n\t\t\t\t\t\t\tSubscribe to my newsletter and receive 3 FREE ebooks!\t\t\t\t\t\t"
    },
    {
      "url": "https://www.indianhealthyrecipes.com/hyderabadi-biryani-recipe/",
      "text": "If you are the site owner (or you manage this site), please whitelist your IP or if you think this block is an error please open a support ticket and make sure to include the block details (displayed in the box below), so we can assist you in troubleshooting the issue. "
    },
    {
      "url": "https://bakewithzoha.com/best-chicken-biryani/",
      "text": "\n              We're checking if you're a real person and not an automated bad bot. Usually, the captcha below will complete itself. If it doesn't, simply click the checkbox in the captcha to verify. Once verified, you'll be taken to the page you wanted to visit.\n            "
    },
    {
      "url": "https://bakewithzoha.com/best-chicken-biryani/",
      "text": "Please mention the \"Ray ID: 97590182f9ba7e91\" and \"Client IP: 106.51.170.86\" to your ticket."
    },
    {
      "url": "https://bakewithzoha.com/best-chicken-biryani/",
      "text": "Ray ID: 97590182f9ba7e91 | Client IP: 106.51.170.86"
    },
    {
      "url": "https://bakewithzoha.com/best-chicken-biryani/",
      "text": "Performance & security by BigScoots"
    }
  ]
}